---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeDefaultBend
source: html/fc81a793-3a1e-e895-8080-bfaa0c06d5e7.htm
---
# RebarShapeConstraint180DegreeDefaultBend Properties

Specifies whether the .NET object represents a valid Revit entity.